import React from 'react'
import {Popover} from 'react-bootstrap'

export const EntrieTutorial = () =>
  <Popover id="popover-positioned-left" title="Підказка для введення поля">
    <div><strong>Кількість корів</strong> кількість корів повинна бути лише ціле число від трьох до чотирьох символів
    </div>
    <div><strong>Ціна на пальне</strong> ціна на пальне повинна бути ціле число або десятковий дріб (приклад 20.14 чи
      20) ціла частина не більше двох знаків
    </div>
    <div><strong>Ціна на електроенергію</strong> ціна на пальне повинна бути ціле число або десятковий дріб (приклад
      20.14 чи 20) ціла частина не більше двох знаків
    </div>
    <div><strong>Заробітня плата</strong> ціна на пальне повинна бути ціле число або десятковий дріб (приклад 20.14 чи
      20) ціла частина не більше двох знаків
    </div>
    <div><strong>Стійловий період</strong> стійловий період повинен містити лише цілі числа не більше 365 і не менше 0
    </div>
  </Popover>
